Thanks for replying.

the task is embedded within a pipeline template as follows:
```
parameters:
- name: terraformPlanOutputFile
  type: string

- task: TerraformCLI@0
  displayName: 'terraform show'
  inputs:
    command: show
    inputTargetPlanOrStateFilePath: '${{ parameters.terraformPlanOutputFile }}' 
```

The top level pipline parameter is fed in using:
```
- template: <Revoked>@templates
  parameters:
    agentPool: "<Revoked>"
    terraformProjectPath: <Revoked>
    terraformVersion: <Revoked>
    environmentServiceName: <Revoked>
    terraformWorkspace: "<Revoked>"
    terraformPlanFilePath: ./terraform.tfplan
```

In terms of what is changing this is an initial build for parsing the TF via CI build within Azure. It builds the infrastructure using the branch name for a number of resources. Once its created it will be destroyed.

one thing i have noticed is that I have the `-detailed-exitcode` enabled and I do get to see the plan in the Azure DevOps UI. So far the terraform itself is very basic and only has two resources as below:

```
# azurerm_key_vault.KeyVault will be created
  + resource "azurerm_key_vault" "KeyVault" {
      + access_policy               = (known after apply)
      + enabled_for_disk_encryption = true
      + id                          = (known after apply)
      + location                    = "westeurope"
      + name                        = "<Revoked>"
      + purge_protection_enabled    = false
      + resource_group_name         = "<Revoked>"
      + sku_name                    = "standard"
      + soft_delete_enabled         = (known after apply)
      + soft_delete_retention_days  = 30
      + tags                        = {
          + "BU"                 = "<Revoked>"
          + "CommitID"           = "<Revoked>"
          + "Product"            = "<Revoked>"
          + "TerraformWorkspace" = "<Revoked>"
        }
      + tenant_id                   = "<Revoked>"
      + vault_uri                   = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_resource_group.DPU will be created
  + resource "azurerm_resource_group" "DPU" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "CI-initialterraform"
      + tags     = {
          + "BU"                 = "<Revoked>"
          + "CommitID"           = "<Revoked>"
          + "Product"            = "<Revoked>"
          + "TerraformWorkspace" = "<Revoked>"
        }
    }
```
